# Група туристи решили да си направят лятна екскурзия до морето. Те тръгват от село Чушкопек.
# Да се напише програма, която пресмята общата сума в левове, която е необходима на туристите за тази екскурзия.
# Разстоянието до морето е 210 километра, а цялата екскурзия е с продължителност 3 дни.
# Тяхната кола изразходва средно по 7 литра на всеки 100 километра, а цената на бензина е 1,85 лв. за един литър.
# За всеки ден от техния престой те харчат пари за храна и сувенири.
# Общата цена за хотел е Z лв. на ден. Като група, първия ден те получават 10% намаление за престоя,
# втория ден - 15% намаление, а третия ден - 20%.
# Вход
# От конзолата се прочитат 3 реда:
#     • Парите за храна за един ден - реално число в интервала (0.00…1500.00]
#     • Парите за сувенири за един ден - реално число в интервала (0.00…1500.00]
#     • Парите за хотел за един ден - реално число в интервала [100.00…5000.00]
# Изход
# На конзолата се отпечатва 1 ред:
# "Money needed: {total money}"
# където {total money} e сумата на общия разход на групата, форматирана до втория знак след десетичната запетая.
total_money = 0
distance = float(210 / 100)
avg_consumption = float(7 * 1.85)
avg_consumption *= distance
days = 3
first_day = 0.9
second_day = 0.85
third_day = 0.8
# Input:
meal_money = float(input())
souveniers_money = float(input())
hotel_money = float(input())
# Output
first_day *= hotel_money
second_day *= hotel_money
third_day *= hotel_money
total_money = first_day + second_day + third_day + souveniers_money * 3 + meal_money * 3 + avg_consumption * 2
print(f'Money needed: {total_money:.2f}')