# Влади е много запален по волейбола, но е зает през работните дни и играе волейбол само през уикендите и в пр. дни.
#
# Влади играе в София всяка събота, когато не е на работа и не си пътува до родния град, както и в
# 2/3 от празничните дни.
#
# Той пътува до родния си град h пъти в годината, където играе волейбол със старите си
# приятели в неделя. Влади не е на работа 3/4 от уикендите, в които е в София. Отделно, през високосните години
# Влади играе с 15% повече волейбол от нормалното. Приемаме, че годината има точно 48 уикенда, подходящи за волейбол.
#
# Напишете програма, която изчислява колко пъти Влади е играл волейбол през годината.
# Закръглете резултата надолу до най-близкото цяло число (например 2.15  2; 9.95  9).
# Входните данни се въвеждат от потребителя, в следния вид:
#     • Първият ред съдържа думата "leap" (високосна година) или "normal" (невисокосна);
#     • Вторият ред съдържа цялото число p – брой празници в годината (които не са събота и неделя);
#     • Третият ред съдържа цялото число h – брой уикенди, в които Влади си пътува до родния град.
import math
year_type = str(input())
p = int(input()) # Броят празници в годината, които не са събота и неделя.
h = int(input()) # Колко пъти в годината Влади пътува до родния град
play_time = (48 - h) * 3 / 4
play_time += h
play_time += (p * 2 / 3)
"Saturday" # Играе всяка събота  което е 3/4 от всички съботи / уикенди
"Sunday" # Играе само в неделите, в които е в родния град, което е 3/4 от всички недели
if year_type == "leap":
    play_time *= 1.15
print(f"{math.floor(play_time)}")
