# Oт конзолата се въвеждат цените в лева на скумрията и цацата. Също количеството на паламуд, сафрид и
# миди в килограми. Колко пари ще са му необходими, за да плати сметката си, ако цените на борсата са:
#     • Паламуд – 60% по-скъп от скумрията
#     • Сафрид – 80% по-скъп от цацата
#     • Миди – 7.50 лв. за килограм
# Вход
# От конзолата се четат 5 числа:
#     • Първи ред – цена на скумрията на килограм. Реално число в интервала [0.00…40.00]
#     • Втори ред – цена на цацата на килограм. Реално число в интервала [0.00…30.00]
#     • Трети ред – килограма паламуд. Реално число в интервала [0.00…50.00]
#     • Четвърти ред – килограма сафрид. Реално число в интервала [0.00… 70.00]
#     • Пети ред – килограма миди. Цяло число в интервала [0 ... 100]
# Изход
# Да се отпечата на конзолата едно число с плаваща запетая: колко пари ще са нужни на Георги, за да си плати
# сметката. Закръглено до вторият знак след десетичната запетая (1.2457 -> 1.25).
# FISHES:
# Initial variable:
money_needed = 0
#
skumria = float(input())
caca = float(input())
# Other fishes in KGs:
palamud = float(input())
safrid = float(input())
midi_kg = int(input())
# Other fishes prices calc:
palamud_calc = skumria + skumria * 0.6
safrid_calc = caca + caca * 0.8
midi_calc = midi_kg * 7.50
# MONEY NEEDED:
money_needed = palamud * palamud_calc + safrid * safrid_calc + midi_calc
# solution
print(f"{money_needed:.2f}")