# При положение, че се движи със скорост от speed километра в час, той ще стигне до там за time часа.
# Приемаме, че distance
# между Луната и Земята е 384 400км. На Луната Георги ще прекара 3 часа, след което ще тръгне обратно за Земята.
# Напишете програма, която пресмята за колко часа Георги ще отиде и ще се върне и колко литра гориво ще са му нужни.
# #
# Входът се чете от конзолата и съдържа точно 2 реда:
#     • На първия ред е средната скорост, с която се движи Георги - реално число в интервала [1000.00... 30000.00]
#     • На втория ред – колко литра гориво са нужни за 100км. - реално число в интервала [1.00…20.00]
# Изход
# Да се отпечатат на конзолата два реда:
#     • Броят на часовете, за които Георги е отишъл и се е върнал (резултатът да се закръгли до по-голямото цяло число)
#     • Броят на литрите гориво, което е нужно.
import math
hours_needed = 0
petrol_needed = 0
distance = 384400
time_to_stay = 3
distance = speed * time
avg_speed = float(input())
petrol_needed = float(input())
#

# Output:
hours_needed = math.ceil(hours_needed)
print(f"{hours_needed}")
print(f"{petrol_needed}")
